jacobg826/BelayBot/code/Program Files/Header Files/TM4CREGISTERS.h
// _TM4CREGISTER HEADER FILE (.h)_
/* 
 * Anton Soderqvist
 * 1975400
 * 4/14/2020
 * This file defines GPIO and GPTM register adresses and some keys to enable
 * them.
*/
#ifndef _TM4CREGISTER_H_
#define _TM4CREGISTER_H_

//_______________________GPIO REGISTERS__________________________________

//To enable GPIO
#define GPIO_TOGGLE (*(volatile unsigned int*)0x400FE608)

//Keys to enable GPIO ports
#define GPIO_PORTA_EN 0x1
#define GPIO_PORTB_EN 0x2
#define GPIO_PORTC_EN 0x4
#define GPIO_PORTD_EN 0x8
#define GPIO_PORTE_EN 0x10
#define GPIO_PORTF_EN 0x20
#define GPIO_PORTG_EN 0x40
#define GPIO_PORTH_EN 0x80
#define GPIO_PORTJ_EN 0x100
#define GPIO_PORTK_EN 0x200
#define GPIO_PORTL_EN 0x400
#define GPIO_PORTM_EN 0x800
#define GPIO_PORTN_EN 0x1000
#define GPIO_PORTP_EN 0x2000
#define GPIO_PORTQ_EN 0x4000

//To write to GPIOLOCK for port J
#define GPIO_LOCK_J (*(volatile unsigned int*)0x40060520)

//key to enable GPIOLOCK
#define GPIO_LOCK_KEY 0x4C4F434B

//To enable GPIO commit register
#define GPIO_CR_J (*(volatile unsigned int*)0x40060524)

//To access/write values to GPIO ports F, N, J, L 3FC
#define GPIO_DATA_A (*(volatile unsigned int*)0x400583FC)
#define GPIO_DATA_B (*(volatile unsigned int*)0x400593FC)
#define GPIO_DATA_C (*(volatile unsigned int*)0x4005A3FC)
#define GPIO_DATA_D (*(volatile unsigned int*)0x4005B3FC)
#define GPIO_DATA_E (*(volatile unsigned int*)0x4005C3FC)
#define GPIO_DATA_F (*(volatile unsigned int*)0x4005D3FC)
#define GPIO_DATA_G (*(volatile unsigned int*)0x4005E3FC)
#define GPIO_DATA_H (*(volatile unsigned int*)0x4005F3FC)
#define GPIO_DATA_J (*(volatile unsigned int*)0x400603FC)
#define GPIO_DATA_K (*(volatile unsigned int*)0x400613FC)
#define GPIO_DATA_L (*(volatile unsigned int*)0x400623FC)
#define GPIO_DATA_M (*(volatile unsigned int*)0x400633FC)
#define GPIO_DATA_N (*(volatile unsigned int*)0x400643FC)
#define GPIO_DATA_P (*(volatile unsigned int*)0x400653FC)
#define GPIO_DATA_Q (*(volatile unsigned int*)0x400663FC)

//To define GPIO ports F, N, J, L as input vs output 
#define GPIO_DIR_A (*(volatile unsigned int*)0x40058400)
#define GPIO_DIR_B (*(volatile unsigned int*)0x40059400)
#define GPIO_DIR_C (*(volatile unsigned int*)0x4005A400)
#define GPIO_DIR_D (*(volatile unsigned int*)0x4005B400)
#define GPIO_DIR_E (*(volatile unsigned int*)0x4005C400)
#define GPIO_DIR_F (*(volatile unsigned int*)0x4005D400)
#define GPIO_DIR_G (*(volatile unsigned int*)0x4005E400)
#define GPIO_DIR_H (*(volatile unsigned int*)0x4005F400)
#define GPIO_DIR_J (*(volatile unsigned int*)0x40060400)
#define GPIO_DIR_K (*(volatile unsigned int*)0x40061400)
#define GPIO_DIR_L (*(volatile unsigned int*)0x40062400)
#define GPIO_DIR_M (*(volatile unsigned int*)0x40063400)
#define GPIO_DIR_N (*(volatile unsigned int*)0x40064400)
#define GPIO_DIR_P (*(volatile unsigned int*)0x40065400)
#define GPIO_DIR_Q (*(volatile unsigned int*)0x40066400)

//To define GPIO ports F, N, J, L as digital 
#define GPIO_DEN_A (*(volatile unsigned int*)0x4005851C)
#define GPIO_DEN_B (*(volatile unsigned int*)0x4005951C)
#define GPIO_DEN_C (*(volatile unsigned int*)0x4005A51C)
#define GPIO_DEN_D (*(volatile unsigned int*)0x4005B51C)
#define GPIO_DEN_E (*(volatile unsigned int*)0x4005C51C)
#define GPIO_DEN_F (*(volatile unsigned int*)0x4005D51C)
#define GPIO_DEN_G (*(volatile unsigned int*)0x4005E51C)
#define GPIO_DEN_H (*(volatile unsigned int*)0x4005F51C)
#define GPIO_DEN_J (*(volatile unsigned int*)0x4006051C)
#define GPIO_DEN_K (*(volatile unsigned int*)0x4006151C)
#define GPIO_DEN_L (*(volatile unsigned int*)0x4006251C)
#define GPIO_DEN_M (*(volatile unsigned int*)0x4006351C)
#define GPIO_DEN_N (*(volatile unsigned int*)0x4006451C)
#define GPIO_DEN_P (*(volatile unsigned int*)0x4006551C)
#define GPIO_DEN_Q (*(volatile unsigned int*)0x4006651C)

//To enable GPIO ports F, N, J, L pull up resistor
#define GPIO_PUR_A (*(volatile unsigned int*)0x40058510)
#define GPIO_PUR_B (*(volatile unsigned int*)0x40059510)
#define GPIO_PUR_C (*(volatile unsigned int*)0x4005A510)
#define GPIO_PUR_D (*(volatile unsigned int*)0x4005B510)
#define GPIO_PUR_E (*(volatile unsigned int*)0x4005C510)
#define GPIO_PUR_F (*(volatile unsigned int*)0x4005D510)
#define GPIO_PUR_G (*(volatile unsigned int*)0x4005E510)
#define GPIO_PUR_H (*(volatile unsigned int*)0x4005F510)
#define GPIO_PUR_J (*(volatile unsigned int*)0x40060510)
#define GPIO_PUR_K (*(volatile unsigned int*)0x40061510)
#define GPIO_PUR_L (*(volatile unsigned int*)0x40062510)
#define GPIO_PUR_M (*(volatile unsigned int*)0x40063510)
#define GPIO_PUR_N (*(volatile unsigned int*)0x40064510)
#define GPIO_PUR_P (*(volatile unsigned int*)0x40065510)
#define GPIO_PUR_Q (*(volatile unsigned int*)0x40066510)

//To enable GPIO Alternate Function Select
#define GPIO_AFSEL_A (*(volatile unsigned int*)0x40058420)
#define GPIO_AFSEL_B (*(volatile unsigned int*)0x40059420)
#define GPIO_AFSEL_C (*(volatile unsigned int*)0x4005A420)
#define GPIO_AFSEL_D (*(volatile unsigned int*)0x4005B420)
#define GPIO_AFSEL_E (*(volatile unsigned int*)0x4005C420)
#define GPIO_AFSEL_F (*(volatile unsigned int*)0x4005D420)
#define GPIO_AFSEL_G (*(volatile unsigned int*)0x4005E420)
#define GPIO_AFSEL_H (*(volatile unsigned int*)0x4005F420)
#define GPIO_AFSEL_J (*(volatile unsigned int*)0x40060420)
#define GPIO_AFSEL_K (*(volatile unsigned int*)0x40061420)
#define GPIO_AFSEL_L (*(volatile unsigned int*)0x40062420)
#define GPIO_AFSEL_M (*(volatile unsigned int*)0x40063420)
#define GPIO_AFSEL_N (*(volatile unsigned int*)0x40064420)
#define GPIO_AFSEL_P (*(volatile unsigned int*)0x40065420)
#define GPIO_AFSEL_Q (*(volatile unsigned int*)0x40066420)

//To enable GPIO Analog Mode for ports  F, N, J, L
#define GPIO_ANAL_A (*(volatile unsigned int*)0x40058528)
#define GPIO_ANAL_B (*(volatile unsigned int*)0x40059528)
#define GPIO_ANAL_C (*(volatile unsigned int*)0x4005A528)
#define GPIO_ANAL_D (*(volatile unsigned int*)0x4005B528)
#define GPIO_ANAL_E (*(volatile unsigned int*)0x4005C528)
#define GPIO_ANAL_F (*(volatile unsigned int*)0x4005D528)
#define GPIO_ANAL_G (*(volatile unsigned int*)0x4005E528)
#define GPIO_ANAL_H (*(volatile unsigned int*)0x4005F528)
#define GPIO_ANAL_J (*(volatile unsigned int*)0x40060528)
#define GPIO_ANAL_K (*(volatile unsigned int*)0x40061528)
#define GPIO_ANAL_L (*(volatile unsigned int*)0x40062528)
#define GPIO_ANAL_M (*(volatile unsigned int*)0x40063528)
#define GPIO_ANAL_N (*(volatile unsigned int*)0x40064528)
#define GPIO_ANAL_P (*(volatile unsigned int*)0x40065528)
#define GPIO_ANAL_Q (*(volatile unsigned int*)0x40066528)

//To enable GPIO interrupt sense for ports F, N, J
#define GPIO_IS_A (*(volatile unsigned int*)0x40058404)
#define GPIO_IS_B (*(volatile unsigned int*)0x40059404)
#define GPIO_IS_C (*(volatile unsigned int*)0x4005A404)
#define GPIO_IS_D (*(volatile unsigned int*)0x4005B404)
#define GPIO_IS_E (*(volatile unsigned int*)0x4005C404)
#define GPIO_IS_F (*(volatile unsigned int*)0x4005D404)
#define GPIO_IS_G (*(volatile unsigned int*)0x4005E404)
#define GPIO_IS_H (*(volatile unsigned int*)0x4005F404)
#define GPIO_IS_J (*(volatile unsigned int*)0x40060404)
#define GPIO_IS_K (*(volatile unsigned int*)0x40061404)
#define GPIO_IS_L (*(volatile unsigned int*)0x40062404)
#define GPIO_IS_M (*(volatile unsigned int*)0x40063404)
#define GPIO_IS_N (*(volatile unsigned int*)0x40064404)
#define GPIO_IS_P (*(volatile unsigned int*)0x40065404)
#define GPIO_IS_Q (*(volatile unsigned int*)0x40066404)

//To enable GPIO interrupt event for ports F, N, J, L
#define GPIO_IEV_A (*(volatile unsigned int*)0x4005840C)
#define GPIO_IEV_B (*(volatile unsigned int*)0x4005940C)
#define GPIO_IEV_C (*(volatile unsigned int*)0x4005A40C)
#define GPIO_IEV_D (*(volatile unsigned int*)0x4005B40C)
#define GPIO_IEV_E (*(volatile unsigned int*)0x4005C40C)
#define GPIO_IEV_F (*(volatile unsigned int*)0x4005D40C)
#define GPIO_IEV_G (*(volatile unsigned int*)0x4005E40C)
#define GPIO_IEV_H (*(volatile unsigned int*)0x4005F40C)
#define GPIO_IEV_J (*(volatile unsigned int*)0x4006040C)
#define GPIO_IEV_K (*(volatile unsigned int*)0x4006140C)
#define GPIO_IEV_L (*(volatile unsigned int*)0x4006240C)
#define GPIO_IEV_M (*(volatile unsigned int*)0x4006340C)
#define GPIO_IEV_N (*(volatile unsigned int*)0x4006440C)
#define GPIO_IEV_P (*(volatile unsigned int*)0x4006540C)
#define GPIO_IEV_Q (*(volatile unsigned int*)0x4006640C)

//To enable GPIO interrupt mask for ports F, N, J, L 
#define GPIO_IM_A (*(volatile unsigned int*)0x40058410)
#define GPIO_IM_B (*(volatile unsigned int*)0x40059410)
#define GPIO_IM_C (*(volatile unsigned int*)0x4005A410)
#define GPIO_IM_D (*(volatile unsigned int*)0x4005B410)
#define GPIO_IM_E (*(volatile unsigned int*)0x4005C410)
#define GPIO_IM_F (*(volatile unsigned int*)0x4005D410)
#define GPIO_IM_G (*(volatile unsigned int*)0x4005E410)
#define GPIO_IM_H (*(volatile unsigned int*)0x4005F410)
#define GPIO_IM_J (*(volatile unsigned int*)0x40060410)
#define GPIO_IM_K (*(volatile unsigned int*)0x40061410)
#define GPIO_IM_L (*(volatile unsigned int*)0x40062410)
#define GPIO_IM_M (*(volatile unsigned int*)0x40063410)
#define GPIO_IM_N (*(volatile unsigned int*)0x40064410)
#define GPIO_IM_P (*(volatile unsigned int*)0x40065410)
#define GPIO_IM_Q (*(volatile unsigned int*)0x40066410)

//To enable GPIO masked interrupt status for ports F, N, J, L
#define GPIO_RIS_A (*(volatile unsigned int*)0x40058414)
#define GPIO_RIS_B (*(volatile unsigned int*)0x40059414)
#define GPIO_RIS_C (*(volatile unsigned int*)0x4005A414)
#define GPIO_RIS_D (*(volatile unsigned int*)0x4005B414)
#define GPIO_RIS_E (*(volatile unsigned int*)0x4005C414)
#define GPIO_RIS_F (*(volatile unsigned int*)0x4005D414)
#define GPIO_RIS_G (*(volatile unsigned int*)0x4005E414)
#define GPIO_RIS_H (*(volatile unsigned int*)0x4005F414)
#define GPIO_RIS_J (*(volatile unsigned int*)0x40060414)
#define GPIO_RIS_K (*(volatile unsigned int*)0x40061414)
#define GPIO_RIS_L (*(volatile unsigned int*)0x40062414)
#define GPIO_RIS_M (*(volatile unsigned int*)0x40063414)
#define GPIO_RIS_N (*(volatile unsigned int*)0x40064414)
#define GPIO_RIS_P (*(volatile unsigned int*)0x40065414)
#define GPIO_RIS_Q (*(volatile unsigned int*)0x40066414)

//To enable GPIO masked interrupt status for ports F, N, J, L
#define GPIO_MIS_A (*(volatile unsigned int*)0x40058418)
#define GPIO_MIS_B (*(volatile unsigned int*)0x40059418)
#define GPIO_MIS_C (*(volatile unsigned int*)0x4005A418)
#define GPIO_MIS_D (*(volatile unsigned int*)0x4005B418)
#define GPIO_MIS_E (*(volatile unsigned int*)0x4005C418)
#define GPIO_MIS_F (*(volatile unsigned int*)0x4005D418)
#define GPIO_MIS_G (*(volatile unsigned int*)0x4005E418)
#define GPIO_MIS_H (*(volatile unsigned int*)0x4005F418)
#define GPIO_MIS_J (*(volatile unsigned int*)0x40060418)
#define GPIO_MIS_K (*(volatile unsigned int*)0x40061418)
#define GPIO_MIS_L (*(volatile unsigned int*)0x40062418)
#define GPIO_MIS_M (*(volatile unsigned int*)0x40063418)
#define GPIO_MIS_N (*(volatile unsigned int*)0x40064418)
#define GPIO_MIS_P (*(volatile unsigned int*)0x40065418)
#define GPIO_MIS_Q (*(volatile unsigned int*)0x40066418)

