jacobg826/BelayBot/code/Program Files/Header Files/TM4CREGISTERS.h
//To enable GPIO interrupt clear for ports F, N, J, L 
#define GPIO_IC_A (*(volatile unsigned int*)0x4005841C)
#define GPIO_IC_B (*(volatile unsigned int*)0x4005941C)
#define GPIO_IC_C (*(volatile unsigned int*)0x4005A41C)
#define GPIO_IC_D (*(volatile unsigned int*)0x4005B41C)
#define GPIO_IC_E (*(volatile unsigned int*)0x4005C41C)
#define GPIO_IC_F (*(volatile unsigned int*)0x4005D41C)
#define GPIO_IC_G (*(volatile unsigned int*)0x4005E41C)
#define GPIO_IC_H (*(volatile unsigned int*)0x4005F41C)
#define GPIO_IC_J (*(volatile unsigned int*)0x4006041C)
#define GPIO_IC_K (*(volatile unsigned int*)0x4006141C)
#define GPIO_IC_L (*(volatile unsigned int*)0x4006241C)
#define GPIO_IC_M (*(volatile unsigned int*)0x4006341C)
#define GPIO_IC_N (*(volatile unsigned int*)0x4006441C)
#define GPIO_IC_P (*(volatile unsigned int*)0x4006541C)
#define GPIO_IC_Q (*(volatile unsigned int*)0x4006641C)

//To set GPIO port control for ports F, N, J, L 
#define GPIO_PCTL_A (*(volatile unsigned int*)0x4005852C)
#define GPIO_PCTL_B (*(volatile unsigned int*)0x4005952C)
#define GPIO_PCTL_C (*(volatile unsigned int*)0x4005A52C)
#define GPIO_PCTL_D (*(volatile unsigned int*)0x4005B52C)
#define GPIO_PCTL_E (*(volatile unsigned int*)0x4005C52C)
#define GPIO_PCTL_F (*(volatile unsigned int*)0x4005D52C)
#define GPIO_PCTL_G (*(volatile unsigned int*)0x4005E52C)
#define GPIO_PCTL_H (*(volatile unsigned int*)0x4005F52C)
#define GPIO_PCTL_J (*(volatile unsigned int*)0x4006052C)
#define GPIO_PCTL_K (*(volatile unsigned int*)0x4006152C)
#define GPIO_PCTL_L (*(volatile unsigned int*)0x4006252C)
#define GPIO_PCTL_M (*(volatile unsigned int*)0x4006352C)
#define GPIO_PCTL_N (*(volatile unsigned int*)0x4006452C)
#define GPIO_PCTL_P (*(volatile unsigned int*)0x4006552C)
#define GPIO_PCTL_Q (*(volatile unsigned int*)0x4006652C)

//To set GPIO open drain select
#define GPIO_ODR_A (*(volatile unsigned int*)0x4005850C)
#define GPIO_ODR_B (*(volatile unsigned int*)0x4005950C)
#define GPIO_ODR_C (*(volatile unsigned int*)0x4005A50C)
#define GPIO_ODR_D (*(volatile unsigned int*)0x4005B50C)
#define GPIO_ODR_E (*(volatile unsigned int*)0x4005C50C)
#define GPIO_ODR_F (*(volatile unsigned int*)0x4005D50C)
#define GPIO_ODR_G (*(volatile unsigned int*)0x4005E50C)
#define GPIO_ODR_H (*(volatile unsigned int*)0x4005F50C)
#define GPIO_ODR_J (*(volatile unsigned int*)0x4006050C)
#define GPIO_ODR_K (*(volatile unsigned int*)0x4006150C)
#define GPIO_ODR_L (*(volatile unsigned int*)0x4006250C)
#define GPIO_ODR_M (*(volatile unsigned int*)0x4006350C)
#define GPIO_ODR_N (*(volatile unsigned int*)0x4006450C)
#define GPIO_ODR_P (*(volatile unsigned int*)0x4006550C)
#define GPIO_ODR_Q (*(volatile unsigned int*)0x4006650C)

//Onboard LED register bits
#define LED4 0x1
#define LED3 0x10
#define LED2 0x1
#define LED1 0x2

//Onboard SW register bits
#define SW1 0x1
#define SW2 0x2

//_______________________GEN-PURP TIMERS________________________

//Enable 16/32 Bit GEN-PURP Timer
#define GPTM_ENABLE (*(volatile unsigned int*)0x400FE604)

//Enable 16/32 Bit GEN-PURP Timer 0
#define GPTM_0 0x1
#define GPTM_1 0x2
#define GPTM_2 0x4
#define GPTM_3 0x8

//Enable interupts 0-31
#define INTERUPT_0_31_EN (*(volatile unsigned int*)0xE000E100)
#define INTERUPT_32_63_EN (*(volatile unsigned int*)0xE000E104)

//enable interupt keys
#define INTERUPT_KEY_19 0x80000

//GPTM Control address for Timer 0
#define GPTM_0_CTL (*(volatile unsigned int*)0x4003000C)
#define GPTM_1_CTL (*(volatile unsigned int*)0x4003100C)
#define GPTM_2_CTL (*(volatile unsigned int*)0x4003200C)
#define GPTM_3_CTL (*(volatile unsigned int*)0x4003300C)

//Disable TIMER A and Timer B via GPTM_X_CTL
#define TIMER_A_DISABLE 0x0
#define TIMER_B_DISABLE 0x000
#define TIMER_A_ENABLE 0x1
#define TIMER_B_ENABLE 0x100


//GPTM Configuration register address for timer 0
#define GPTM_0_CONFIG (*(volatile unsigned int*)0x40030000)
#define GPTM_1_CONFIG (*(volatile unsigned int*)0x40031000)
#define GPTM_2_CONFIG (*(volatile unsigned int*)0x40032000)
#define GPTM_3_CONFIG (*(volatile unsigned int*)0x40033000)


//Reset GPTM Configuration register key
#define GPTM_CONFIG_RESET 0x00000000

//configure 32 bit timer GPTM Config
#define GPTM_CONFIG_32 0x0

//GPTM Timer A Mode register for timer 0
#define GPTM_0_A_MODE (*(volatile unsigned int*)0x40030004)
#define GPTM_1_A_MODE (*(volatile unsigned int*)0x40031004)
#define GPTM_2_A_MODE (*(volatile unsigned int*)0x40032004)
#define GPTM_3_A_MODE (*(volatile unsigned int*)0x40033004)

//GPTM TIMER A mode TAMR periodic timer
#define GPTM_TAMR_PERIODIC 0x2 

//GPTM Timer A mode count direction down
#define GPTM_TADIR_D 0x00

//GPTM TImer A interval load register for timer 0
#define GPTM_0_TAILR (*(volatile unsigned int*)0x40030028)
#define GPTM_1_TAILR (*(volatile unsigned int*)0x40031028)
#define GPTM_2_TAILR (*(volatile unsigned int*)0x40032028)
#define GPTM_3_TAILR (*(volatile unsigned int*)0x40033028)

//GPTM TIMER A load 16,000,000
#define GPTM_TAILR_16M 0xF42400

//GPTM TIMER A load 32,000,000
#define GPTM_TAILR_32M 0x1E84800

//GPTM TIMER A load 80,000,000
#define GPTM_TAILR_80M 0x4C4B400

//GPTM Interupt Mask register for timer 0
#define GPTM_0_IM (*(volatile unsigned int*)0x40030018)
#define GPTM_1_IM (*(volatile unsigned int*)0x40031018)
#define GPTM_2_IM (*(volatile unsigned int*)0x40032018)
#define GPTM_3_IM (*(volatile unsigned int*)0x40033018)

//GPTM Raw Interupt Status timer 0 register
#define  GPTM_0_RIS (*(volatile unsigned int*)0x4003001C)
#define  GPTM_1_RIS (*(volatile unsigned int*)0x4003101C)
#define  GPTM_2_RIS (*(volatile unsigned int*)0x4003201C)
#define  GPTM_3_RIS (*(volatile unsigned int*)0x4003301C)

//GPTM Timer A raw interupt status (timed out?)
#define GPTM_RIS_A_TOUT 0x1

//GPTM Interupt Clear register timer 0
#define  GPTM_0_RIC (*(volatile unsigned int*)0x40030024)
#define  GPTM_1_RIC (*(volatile unsigned int*)0x40031024)
#define  GPTM_2_RIC (*(volatile unsigned int*)0x40032024)
#define  GPTM_3_RIC (*(volatile unsigned int*)0x40033024)

//GPTM ADC event register timer 0
#define  GPTM_0_ADCE (*(volatile unsigned int*)0x40030070)
#define  GPTM_1_ADCE (*(volatile unsigned int*)0x40031070)
#define  GPTM_2_ADCE (*(volatile unsigned int*)0x40032070)
#define  GPTM_3_ADCE (*(volatile unsigned int*)0x40033070)

//GPTM Interupt Clear Timer A
#define GPTM_RIC_TA 0x1

//__________________________ADC Keywords_______________________________

//Enable ADC clock
#define ADC_ENABLE (*(volatile unsigned int*)0x400FE638)

//ADC Active Sample Sequencer registers
#define  ADC_0_ASS (*(volatile unsigned int*)0x40038000)
#define  ADC_1_ASS (*(volatile unsigned int*)0x40039000)

