jacobg826/BelayBot/code/Program Files/Header Files/TM4CREGISTERS.h
//ADC Event Mux Select registers
#define  ADC_0_EMS (*(volatile unsigned int*)0x40038014)
#define  ADC_1_EMS (*(volatile unsigned int*)0x40039014)

//Analog input configuration for Sample Sequencer 3
#define ADC_0_SSIMS3 (*(volatile unsigned int*)0x400380A0)
#define ADC_1_SSIMS3 (*(volatile unsigned int*)0x400390A0)

//ADC Sample Sequence Extended Input Multiplexer Select 3 registers
#define ADC_0_SSEMS3 (*(volatile unsigned int*)0x400380B8)
#define ADC_1_SSEMS3 (*(volatile unsigned int*)0x400390B8)

//ADC Sample Sequencer Control 3 registers
#define ADC_0_SSCTL3 (*(volatile unsigned int*)0x400380A4)
#define ADC_1_SSCTL3 (*(volatile unsigned int*)0x400390A4)

//ADC Interrupt Mask registers
#define ADC_0_IM (*(volatile unsigned int*)0x40038008)
#define ADC_1_IM (*(volatile unsigned int*)0x40039008)

//ADC Clock Configuration registers
#define ADC_0_CC (*(volatile unsigned int*)0x40038FC8)
#define ADC_1_CC (*(volatile unsigned int*)0x40039FC8)

//ADC Sample Sequence Result registers
#define ADC_0_SSR (*(volatile unsigned int*)0x400380A8)
#define ADC_1_SSR (*(volatile unsigned int*)0x400390A8)

//ADC Interrupt Status and Clear registers
#define ADC_0_ISC (*(volatile unsigned int*)0x4003800C)
#define ADC_1_ISC (*(volatile unsigned int*)0x4003900C)

//ADC Sample Sequence 3 Sample and Hold Time Registers
#define ADC_0_SHT (*(volatile unsigned int*)0x400380BC)
#define ADC_1_SHT (*(volatile unsigned int*)0x400390BC)

//_______________________ALTERNATE CLOCK_____________________________

#define ALTCLK_CC (*(volatile unsigned int*)0x400FE138)

//_______________________UART Registers______________________________

//enabe UART module
#define UART_ENABLE (*(volatile unsigned int*)0x400FE618)

//UART DATA registers (Tx or Rx)
#define UART_0_DATA (*(volatile unsigned int*)0x4000C000)
#define UART_1_DATA (*(volatile unsigned int*)0x4000D000)
#define UART_2_DATA (*(volatile unsigned int*)0x4000E000)
#define UART_3_DATA (*(volatile unsigned int*)0x4000F000)
#define UART_4_DATA (*(volatile unsigned int*)0x40010000)
#define UART_5_DATA (*(volatile unsigned int*)0x40011000)
#define UART_6_DATA (*(volatile unsigned int*)0x40012000)
#define UART_7_DATA (*(volatile unsigned int*)0x40013000)

//UART Receive status and error clear registers
#define UART_0_RSEC (*(volatile unsigned int*)0x4000C004)
#define UART_1_RSEC (*(volatile unsigned int*)0x4000D004)
#define UART_2_RSEC (*(volatile unsigned int*)0x4000E004)
#define UART_3_RSEC (*(volatile unsigned int*)0x4000F004)
#define UART_4_RSEC (*(volatile unsigned int*)0x40010004)
#define UART_5_RSEC (*(volatile unsigned int*)0x40011004)
#define UART_6_RSEC (*(volatile unsigned int*)0x40012004)
#define UART_7_RSEC (*(volatile unsigned int*)0x40013004)

//UART Flag registers
#define UART_0_FLAG (*(volatile unsigned int*)0x4000C018)
#define UART_1_FLAG (*(volatile unsigned int*)0x4000D018)
#define UART_2_FLAG (*(volatile unsigned int*)0x4000E018)
#define UART_3_FLAG (*(volatile unsigned int*)0x4000F018)
#define UART_4_FLAG (*(volatile unsigned int*)0x40010018)
#define UART_5_FLAG (*(volatile unsigned int*)0x40011018)
#define UART_6_FLAG (*(volatile unsigned int*)0x40012018)
#define UART_7_FLAG (*(volatile unsigned int*)0x40013018)

//UART Integer Baud Rate Divisor registers
#define UART_0_IBRD (*(volatile unsigned int*)0x4000C024)
#define UART_1_IBRD (*(volatile unsigned int*)0x4000D024)
#define UART_2_IBRD (*(volatile unsigned int*)0x4000E024)
#define UART_3_IBRD (*(volatile unsigned int*)0x4000F024)
#define UART_4_IBRD (*(volatile unsigned int*)0x40010024)
#define UART_5_IBRD (*(volatile unsigned int*)0x40011024)
#define UART_6_IBRD (*(volatile unsigned int*)0x40012024)
#define UART_7_IBRD (*(volatile unsigned int*)0x40013024)

//UART Fractional Baud Rate Divisor registers
#define UART_0_FBRD (*(volatile unsigned int*)0x4000C028)
#define UART_1_FBRD (*(volatile unsigned int*)0x4000D028)
#define UART_2_FBRD (*(volatile unsigned int*)0x4000E028)
#define UART_3_FBRD (*(volatile unsigned int*)0x4000F028)
#define UART_4_FBRD (*(volatile unsigned int*)0x40010028)
#define UART_5_FBRD (*(volatile unsigned int*)0x40011028)
#define UART_6_FBRD (*(volatile unsigned int*)0x40012028)
#define UART_7_FBRD (*(volatile unsigned int*)0x40013028)

//UART Line Control registers
#define UART_0_LCTL (*(volatile unsigned int*)0x4000C02C)
#define UART_1_LCTL (*(volatile unsigned int*)0x4000D02C)
#define UART_2_LCTL (*(volatile unsigned int*)0x4000E02C)
#define UART_3_LCTL (*(volatile unsigned int*)0x4000F02C)
#define UART_4_LCTL (*(volatile unsigned int*)0x4001002C)
#define UART_5_LCTL (*(volatile unsigned int*)0x4001102C)
#define UART_6_LCTL (*(volatile unsigned int*)0x4001202C)
#define UART_7_LCTL (*(volatile unsigned int*)0x4001302C)

//UART Control registers
#define UART_0_CTL (*(volatile unsigned int*)0x4000C030)
#define UART_1_CTL (*(volatile unsigned int*)0x4000D030)
#define UART_2_CTL (*(volatile unsigned int*)0x4000E030)
#define UART_3_CTL (*(volatile unsigned int*)0x4000F030)
#define UART_4_CTL (*(volatile unsigned int*)0x40010030)
#define UART_5_CTL (*(volatile unsigned int*)0x40011030)
#define UART_6_CTL (*(volatile unsigned int*)0x40012030)
#define UART_7_CTL (*(volatile unsigned int*)0x40013030)

//UART Control registers
#define UART_0_CC (*(volatile unsigned int*)0x4000CFC8)
#define UART_1_CC (*(volatile unsigned int*)0x4000DFC8)
#define UART_2_CC (*(volatile unsigned int*)0x4000EFC8)
#define UART_3_CC (*(volatile unsigned int*)0x4000FFC8)
#define UART_4_CC (*(volatile unsigned int*)0x40010FC8)
#define UART_5_CC (*(volatile unsigned int*)0x40011FC8)
#define UART_6_CC (*(volatile unsigned int*)0x40012FC8)
#define UART_7_CC (*(volatile unsigned int*)0x40013FC8)

//_______________________I2C Registers______________________________

#define I2C_ENABLE (*(volatile unsigned int*)0x400FE620)

//i2c Master control register
#define I2C_0_MCR (*(volatile unsigned int*)0x40020020)
#define I2C_1_MCR (*(volatile unsigned int*)0x40021020)
#define I2C_2_MCR (*(volatile unsigned int*)0x40022020)
#define I2C_3_MCR (*(volatile unsigned int*)0x40023020)
#define I2C_4_MCR (*(volatile unsigned int*)0x400C0020)
#define I2C_5_MCR (*(volatile unsigned int*)0x400C1020)
#define I2C_6_MCR (*(volatile unsigned int*)0x400C2020)
#define I2C_7_MCR (*(volatile unsigned int*)0x400C3020)
#define I2C_8_MCR (*(volatile unsigned int*)0x400B8020)
#define I2C_9_MCR (*(volatile unsigned int*)0x400B9020)

//I2C Master Timer Period
#define I2C_0_MTPR (*(volatile unsigned int*)0x4002000C)
#define I2C_1_MTPR (*(volatile unsigned int*)0x4002100C)
#define I2C_2_MTPR (*(volatile unsigned int*)0x4002200C)
#define I2C_3_MTPR (*(volatile unsigned int*)0x4002300C)
#define I2C_4_MTPR (*(volatile unsigned int*)0x400C000C)
#define I2C_5_MTPR (*(volatile unsigned int*)0x400C100C)
#define I2C_6_MTPR (*(volatile unsigned int*)0x400C200C)
#define I2C_7_MTPR (*(volatile unsigned int*)0x400C300C)
#define I2C_8_MTPR (*(volatile unsigned int*)0x400B800C)
#define I2C_9_MTPR (*(volatile unsigned int*)0x400B900C)

//i2c Master slave address
#define I2C_0_MSA (*(volatile unsigned int*)0x40020000)
#define I2C_1_MSA (*(volatile unsigned int*)0x40021000)
#define I2C_2_MSA (*(volatile unsigned int*)0x40022000)
#define I2C_3_MSA (*(volatile unsigned int*)0x40023000)
#define I2C_4_MSA (*(volatile unsigned int*)0x400C0000)
#define I2C_5_MSA (*(volatile unsigned int*)0x400C1000)
#define I2C_6_MSA (*(volatile unsigned int*)0x400C2000)
#define I2C_7_MSA (*(volatile unsigned int*)0x400C3000)
#define I2C_8_MSA (*(volatile unsigned int*)0x400B8000)
#define I2C_9_MSA (*(volatile unsigned int*)0x400B9000)

//i2c Master Data transmit register
#define I2C_0_MDR (*(volatile unsigned int*)0x40020008)
#define I2C_1_MDR (*(volatile unsigned int*)0x40021008)
#define I2C_2_MDR (*(volatile unsigned int*)0x40022008)
#define I2C_3_MDR (*(volatile unsigned int*)0x40023008)
#define I2C_4_MDR (*(volatile unsigned int*)0x400C0008)
#define I2C_5_MDR (*(volatile unsigned int*)0x400C1008)
#define I2C_6_MDR (*(volatile unsigned int*)0x400C2008)
#define I2C_7_MDR (*(volatile unsigned int*)0x400C3008)
#define I2C_8_MDR (*(volatile unsigned int*)0x400B8008)
#define I2C_9_MDR (*(volatile unsigned int*)0x400B9008)

//i2c Master Data transmit register
#define I2C_0_MCS (*(volatile unsigned int*)0x40020004)
#define I2C_1_MCS (*(volatile unsigned int*)0x40021004)
#define I2C_2_MCS (*(volatile unsigned int*)0x40022004)
#define I2C_3_MCS (*(volatile unsigned int*)0x40023004)
#define I2C_4_MCS (*(volatile unsigned int*)0x400C0004)
#define I2C_5_MCS (*(volatile unsigned int*)0x400C1004)
#define I2C_6_MCS (*(volatile unsigned int*)0x400C2004)
#define I2C_7_MCS (*(volatile unsigned int*)0x400C3004)
#define I2C_8_MCS (*(volatile unsigned int*)0x400B8004)
#define I2C_9_MCS (*(volatile unsigned int*)0x400B9004)

#endif